/****************************************************************************************************
 * @file    lcd_demo.c
 * @brief   「ACM1602NI-FLW-FBW-M01」用のデバイスドライバモジュールを使用したDEMOコード
 *
 * @author  Masakazu Inoue
 * @date    2026/06/14          新規作成
 ****************************************************************************************************/

/****************************************************************************************************
 * Private include
 ****************************************************************************************************/
#include "lcd_demo.h"

#include "stdint.h"
#include "stm32f4xx_hal.h"

/**
 * @brief 「ACM1602NI-FLW-FBW-M01」用デバイスドライバモジュール
 */
#include "../../../inc/acm1602ni.h"

/****************************************************************************************************
 * Private define
 ****************************************************************************************************/

/****************************************************************************************************
 * Private typedef
 ****************************************************************************************************/

/****************************************************************************************************
 * Private Global Variables
 ****************************************************************************************************/
extern I2C_HandleTypeDef hi2c1;

/****************************************************************************************************
 * Private Prototype Declaration
 ****************************************************************************************************/
static int lcd_send_cb(uint8_t address, const uint8_t *pData, uint32_t length, uint32_t wait);

/**
 * @brief LCDモジュールのデモ表示
 */
void lcd_demo(void)
{
    /* ACM1602NI-FLW-FBW-M01の初期化・送信コールバックの設定 */
    acm1602ni_init(lcd_send_cb);

    /* 1/2行目に表示する文字列を設定 */
    acm1602ni_write_string_at("LCD DEMO!!",    0, 0);
    acm1602ni_write_string_at("for ACM1602NI", 1, 0);
}

/**
 * @brief 送信コールバック
 * @param address スレーブアドレス
 * @param pData   送信データを示すメモリ領域
 * @param length  送信データの長さ
 * @param wait    送信完了後の待ち
 */
static int lcd_send_cb(uint8_t address, const uint8_t *pData, uint32_t length, uint32_t wait)
{
    /* 送信実行 */
    HAL_I2C_Master_Transmit(&hi2c1, ((uint16_t)address), ((uint8_t *)pData), length, 1000);

    HAL_Delay(wait);

    return 0;
}
