/****************************************************************************************************
 * FILE NAME   : if_lcd.c
 * Description : LCD制御用インターフェース
 *               このファイルでは、I2Cインターフェースを使用するLCDモジュールを定義しています。
 *---------------------------------------------------------------------------------------------------
 * HISTORY     : 2025/09/13 : 新規作成
 ****************************************************************************************************/

/****************************************************************************************************
 * Private include
 ****************************************************************************************************/
#include    "if_lcd.h"

#include    "stm32f4xx_hal.h"

/****************************************************************************************************
 * Private define
 ****************************************************************************************************/

/****************************************************************************************************
 * Private typedef
 ****************************************************************************************************/

/****************************************************************************************************
 * Private Variables
 ****************************************************************************************************/
extern I2C_HandleTypeDef hi2c1;

/****************************************************************************************************
 * Private Functions
 ****************************************************************************************************/
static void iLcd_writeData( char *data );

/****************************************************************************************************
 * Function Name : iLcd_writeData
 * Description   : LCD設定データ書き込み処理
 *                 ディスプレイに表示するデータをI2Cドライバーに渡します。
 *---------------------------------------------------------------------------------------------------
 * Input  : data : 設定データ格納ポインタ
 * Output : None
 * Return : None
 ****************************************************************************************************/
static void iLcd_writeData( char *data )
{
    /* LCDデバイスへの送信データをI2Cドライバーにセット */
    HAL_I2C_Master_Transmit( &hi2c1, data[0], (uint8_t *)&data[1], 2, 1000 );

    HAL_Delay(3);       /* wait : 3ms */
}

/****************************************************************************************************
 * Function Name : iLcd_writeDisplay
 * Description   : LCDデータ(表示)書き込み処理
 *                 ディスプレイにASCIIデータの表示を行います。
 *                 表示する行・列は引き数で指定します。表示するメッセージデータの数(サイズ)は指定しませんが、
 *                 表示可能な数はハードウェアの仕様に依存します。
 *---------------------------------------------------------------------------------------------------
 * Input  : msg : 表示するメッセージデータ格納ポインタ
 * Input  : row : 表示開始列
 * Input  : col : 表示開始行
 * Output : None
 * Return : None
 ****************************************************************************************************/
void iLcd_writeDisplay( char *msg, short row, short col )
{
    char buf[3];

    /* DDRAMの位置を移動 */
    iLcd_moveDDramAddress( row, col );

    /* フォーマットの作成 */
    buf[0] = I2C_SLAVE_ADDRESS | WRITE_BIT;             /* スレーブアドレス+writeビット */
    buf[1] = CONTROL_BYTE_DATA;                         /* 制御バイトに「データ(表示)」を指定 */

    do
    {
        /* データは1フレーム(ADDRESS + 制御バイト + データバイト)毎に送信 */
        buf[2] = *(msg++);
        iLcd_writeData( &buf[0] );
    } while (*msg != '\0');
}

/****************************************************************************************************
 * Function Name : iLcd_writeControl
 * Description   : LCDコマンド書き込み処理
 *                 コマンドの書き込みを行います。
 *---------------------------------------------------------------------------------------------------
 * Input  : cmd : コマンドデータ
 * Return : None
 ****************************************************************************************************/
void iLcd_writeControl( char cmd )
{
    char buf[3];

    buf[0] = I2C_SLAVE_ADDRESS | WRITE_BIT;             /* スレーブアドレス+writeビット */
    buf[1] = CONTROL_BYTE_CMD;                          /* 制御バイトに「コマンド」を指定 */
    buf[2] = cmd;                                       /* コマンドバイト設定 */

    iLcd_writeData( &buf[0] );
}

/****************************************************************************************************
 * Function Name : iLcd_moveDDramAddress
 * Description   : DDRAM ADDRESS移動処理
 *                 引数で指定された値を表示開始位置としてDDRAM ADDRESSの設定を行います。
 *---------------------------------------------------------------------------------------------------
 * Input  : row : 表示列
 * Input  : col : 表示行
 * Output : None
 * Return : None
 ****************************************************************************************************/
void iLcd_moveDDramAddress( short row, short col )
{
    char cmd = CMD_BYTE_SET_DDRAM_ADDR;     /* コマンドbit */
    char rows[2] ={ 0x00, 0x40 };

    if ((row < DISPLAY_ROW_SIZE) &&         /* 列数は範囲以内？ */
        (0x00 <= col) && (col <= 0x0F))     /* 行数は範囲以内？ */
    {
        cmd = cmd | (rows[row] | col);      /* DDRAM　ADDRESSの指定値を作成 */
    }
    else
    {
        cmd = cmd | 0x00;                   /* 範囲エラーはHOME位置(00H)に戻す */
    }

    /* DDRAM移動コマンド発行 */
    iLcd_writeControl( cmd );
}

/****************************************************************************************************
 * Function Name : iLcd_displayClear
 * Description   : 画面表示クリア処理
 *                 ディスプレイ上に表示をクリアにし、DDRAM ADDRESSの表示位置を開始行(00H)に戻します。
 *---------------------------------------------------------------------------------------------------
 * Input  : None
 * Output : None
 * Return : None
 ****************************************************************************************************/
void iLcd_displayClear( void )
{
    /* クリアコマンド発行 */
    iLcd_writeControl( CMD_BYTE_DISPLAY_CLR );
}

/****************************************************************************************************
 * Function Name : iLcd_displayHome
 * Description   : 表示位置回帰処理
 *                 DDRAM ADDRESSの表示位置を開始行(00H)に戻します。
 *---------------------------------------------------------------------------------------------------
 * Input  : None
 * Output : None
 * Return : None
 ****************************************************************************************************/
void iLcd_displayHome( void )
{
    /* ホームコマンド発行 */
    iLcd_writeControl( CMD_BYTE_DISPLAY_HOME );
}

/****************************************************************************************************
 * Function Name : iLcd_setEntryMode
 * Description   : エントリーモード設定処理
 *                 データ書き込み後の表示制御を行います。
 *---------------------------------------------------------------------------------------------------
 * Input  : type : 設定タイプ
 * Output : None
 * Return : None
 ****************************************************************************************************/
void iLcd_setEntryMode( short type )
{
    /**************************************************
     * エントリーモードの設定値と動作は以下の通りです。
     * bit[2] : コマンドbit
     * bit[1] : (I/D)Direction : 0 : 右シフト
     *                           1 : 左シフト
     * bit[0] : (S)Shift       : 0 : シフト無効
     *                           1 : シフト有効
     **************************************************/
    char cmd = CMD_BYTE_ENTRY_MODE;             /* コマンドbit */
    char mode[4] =
    {
        0x00,       /* 表示のシフト無し */
        0x01,       /* 表示全体を右にシフト */
        0x02,       /* 表示のシフト無し */
        0x03        /* 表示全体を左にシフト */
    };

    cmd = cmd | mode[type];         /* コマンドデータを作成 */

    /* エントリーモード設定コマンド発行 */
    iLcd_writeControl( cmd );
}

/****************************************************************************************************
 * Function Name : iLcd_setOnOffControl
 * Description   : ディスプレイ表示のON or OFF設定処理
 *                 ディスプレイの表示状態(画面表示／カーソル／カーソル点滅)の有無を設定します。
 *                 (D)Displayが0のときはディスプレイへの表示は行われません。
 *---------------------------------------------------------------------------------------------------
 * Input  : type : 設定タイプ
 * Output : None
 * Return : None
 ****************************************************************************************************/
void iLcd_setOnOffControl( short type )
{
    /**************************************************
     * 表示状態設定処理の設定値と動作は以下の通りです。
     * bit[3] : コマンドbit
     * bit[2] : (D)Display : 0 : 表示OFF
     *                       1 : 表示ON
     * bit[1] : (C)Cursor  : 0 : カーソルOFF
     *                       1 : カーソルON
     * bit[0] : (B)Blink   : 0 : 点滅OFF
     *                       1 : 点滅ON
     **************************************************/
    char cmd = CMD_BYTE_ONOFF_CONTROL;          /* コマンドbit */
    char mode[5] =
    {
        0x00,       /* 表示OFF */
        0x04,       /* 表示ON  */
        0x05,       /* 表示ON + 点滅ON */
        0x06,       /* 表示ON + カーソルON */
        0x07        /* 表示ON + カーソルON + 点滅ON */
    };

    cmd = cmd | mode[type];         /* コマンドデータを作成 */

    /* 表示状態設定コマンド発行 */
    iLcd_writeControl( cmd );
}

/****************************************************************************************************
 * Function Name : iLcd_setCursorShift
 * Description   : シフト方向設定処理
 *                 カーソルorディスプレイのシフト方向を設定します。
 *---------------------------------------------------------------------------------------------------
 * Input  : type : 設定タイプ
 * Output : None
 * Return : None
 ****************************************************************************************************/
void iLcd_setCursorShift( short type )
{
    /**************************************************
     * シフト方向の設定値と動作は以下の通りです。
     * bit[4] : コマンドbit
     * bit[3] : S/C : 0 : スクリーン
     *                1 : カーソル
     * bit[2] : R/L : 0 : 左シフト
     *                1 : 右シフト
     * bit[1] : None
     * bit[0] : None
     **************************************************/
    char cmd = CMD_BYTE_CURSOR_SHIFT;           /* コマンドbit */
    char mode[4] =
    {
        0x00,       /* カーソルを左シフト */
        0x04,       /* カーソルを右シフト */
        0x08,       /* スクリーンを左シフト */
        0x0C        /* スクリーンを右シフト */
    };

    cmd = cmd | mode[type];         /* コマンドデータを作成 */

    /* シフト方向設定コマンド発行 */
    iLcd_writeControl( cmd );
}

/****************************************************************************************************
 * Function Name : iLcd_setFunction
 * Description   : 機能設定処理
 *                 ディスプレイの制御・表示タイプの設定を行います。
 *                 Data Lengthは8bit modeに固定してください。
 *---------------------------------------------------------------------------------------------------
 * Input  : type : 設定タイプ
 * Output : None
 * Return : None
 ****************************************************************************************************/
void iLcd_setFunction( short type )
{
    /**************************************************
     * 機能設定処理の設定値と動作は以下の通りです。
     * bit[5] : コマンドbit
     * bit[4] : (DL)Data Length : 0 : 4-bit mode
     *                            1 : 8-bit mode
     * bit[3] : (N)Display Line : 0 : 1-line mode
     *                            1 : 2-line mode
     * bit[2] : (F)Font Size    : 0 : 5*8  dots
     *                            1 : 5*10 dots
     * bit[1] : None
     * bit[0] : None
     **************************************************/
    char cmd = CMD_BYTE_FUNCTION_SET;           /* コマンドbit */
    char mode[4] =
    {
        0x10,       /* 8bit mode + 1-line mode + 5*8  dots */
        0x18,       /* 8bit mode + 2-line mode + 5*8  dots */
    };

    cmd = cmd | mode[type];         /* コマンドデータを作成 */

    /* 機能設定コマンド発行 */
    iLcd_writeControl( cmd );
}

/****************************************************************************************************
 * Function Name : iLcd_backLightControl
 * Description   : バックライト制御処理
 *---------------------------------------------------------------------------------------------------
 * Input  : light : 点灯状態 : 0FF(0) / ON(1)
 * Output : None
 * Return : None
 ****************************************************************************************************/
void iLcd_backLightControl( short light)
{
    /* pin設定 */
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, (GPIO_PinState)light);
}