/****************************************************************************************************
 * @file    acm1602ni.h
 * @brief   LCDデバイスの「ACM1602NI-FLW-FBW-M01」制御用デバイスドライバ
 * @details 外部公開するAPI、型定義、マクロを定義する
 *
 * @author  
 * @date    2026/06/14     新規作成
 ****************************************************************************************************/
#ifndef __ACM1602NI_H__
#define __ACM1602NI_H__

/****************************************************************************************************
 * Public include
 ****************************************************************************************************/
#include "stdint.h"
#include "stdbool.h"

/****************************************************************************************************
 * Public define
 ****************************************************************************************************/

/*** 表示可能領域(2x16) ***/
#define ACM1602NI_LINE_MAX               2      /* 行数 */
#define ACM1602NI_COLUMN_MAX            16      /* 列数 */


/*** 処理結果 ***/
#define ACM1602NI_OK            0
#define ACM1602NI_NG            1

#define ACM1602NI_ERROR_ARG     -1
#define ACM1602NI_ERROR_CB      -2

/****************************************************************************************************
 * Public typedef
 ****************************************************************************************************/

/**
 * @brief I2C書き込みコールバック
 * @param address スレーブアドレス
 * @param pData   送信データを示すメモリ領域
 * @param length  送信データの長さ
 * @param wait    送信完了後の待ち
 */
typedef int (*i2c_cb_t)(uint8_t address, const uint8_t *pData, uint32_t length, uint32_t wait);

/****************************************************************************************************
 * Public Variables
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

/**
 * @brief ACM1602NI初期化
 * @return 処理結果
 */
int acm1602ni_init(i2c_cb_t callback);

/**
 * @brief 現在の行列位置から文字列の書き込みを行う。
 *        行列位置の終端に到達した場合は先頭位置に循環する。
 * @param string 文字列のメモリ領域
 */
int acm1602ni_write_string(const char *string);

/**
 * @brief 指定した行列位置を起点に文字列の書き込みを行う。
 * @param string 文字列のメモリ領域
 * @param line   行位置
 * @param column 列位置
 */
int acm1602ni_write_string_at(const char *string, uint16_t line, uint16_t column);


/*** 画面状態制御用API ***/

/**
 * @brief LCD画面の表示内容をすべて消す
 */
int acm1602ni_display_clear(void);

/**
 * @brief LCD画面の表示をONにする
 */
int acm1602ni_display_on(void);

/**
 * @brief LCD画面の表示をOffにする
 */
int acm1602ni_display_off(void);

/**
 * @brief LCD画面にカーソル"_"を表示する
 * @param is_blink カーソルの点滅設定
 */
int acm1602ni_cursor_on(bool is_blink);

/**
 * @brief LCD画面にカーソル"_"を非表示にする
 */
int acm1602ni_cursor_off(void);

/**
 * @brief LCD画面にカーソル"_"を行列の0番目に移動する
 */
int acm1602ni_cursor_home(void);

/**
 * @brief LCD画面上のカーソル"_"位置と文字列の書き込み位置移動
 *        カーソルの表示有無にかかわらず、APIの実行後は指定した位置より文字列の書き込みが行われる
 * @param line   移動する行位置
 * @param column 移動する列位置
 */
int acm1602ni_cursor_move(uint16_t line, uint16_t column);


#endif  /* __ACM1602NI_H__ */